tutorials/fluidSolidInteraction/3dTube/constant/fluid/fluidProperties
fluidProperties.robin